<a href="https://colab.research.google.com/github/Dominic2681998/Data_Science/blob/main/housingprice_multipleLinear.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import numpy as np
from sklearn.model_selection import train_test_split
from sklearn.metrics import r2_score
from sklearn.linear_model import LinearRegression

In [87]:
house=pd.read_csv("kc_house_data.csv")
house.head()

           id             date     price  ...     long  sqft_living15  sqft_lot15
0  7129300520  20141013T000000  221900.0  ... -122.257           1340        5650
1  6414100192  20141209T000000  538000.0  ... -122.319           1690        7639
2  5631500400  20150225T000000  180000.0  ... -122.233           2720        8062
3  2487200875  20141209T000000  604000.0  ... -122.393           1360        5000
4  1954400510  20150218T000000  510000.0  ... -122.045           1800        7503

[5 rows x 21 columns]

In [89]:
df=house.drop(["id","date"],axis=1)

In [90]:
df.head()

      price  bedrooms  bathrooms  ...     long  sqft_living15  sqft_lot15
0  221900.0         3       1.00  ... -122.257           1340        5650
1  538000.0         3       2.25  ... -122.319           1690        7639
2  180000.0         2       1.00  ... -122.233           2720        8062
3  604000.0         4       3.00  ... -122.393           1360        5000
4  510000.0         3       2.00  ... -122.045           1800        7503

[5 rows x 19 columns]

In [91]:
x=df.iloc[:,1:-1]
x.head()

   bedrooms  bathrooms  sqft_living  ...      lat     long  sqft_living15
0         3       1.00         1180  ...  47.5112 -122.257           1340
1         3       2.25         2570  ...  47.7210 -122.319           1690
2         2       1.00          770  ...  47.7379 -122.233           2720
3         4       3.00         1960  ...  47.5208 -122.393           1360
4         3       2.00         1680  ...  47.6168 -122.045           1800

[5 rows x 17 columns]

In [92]:
y=df.iloc[:,0]
y.head()

0    221900.0
1    538000.0
2    180000.0
3    604000.0
4    510000.0
Name: price, dtype: float64

In [93]:
x_train,x_test,y_train,y_test=train_test_split(x,y,test_size=.3)

In [94]:
multiple=LinearRegression()

In [95]:
multiple.fit(x_train,y_train)

LinearRegression()

In [96]:
predict=multiple.predict(x_test)

In [97]:
predict

array([ 482585.90321346,  562868.97101393,  361340.15235561, ...,
        384644.23015278, 1483037.78196623,  337558.87178535])

In [98]:
y_test

20904     519990.0
17675     325000.0
7617      288250.0
13948     790000.0
5885      230000.0
           ...
18249     395000.0
1728      200000.0
4311      339000.0
20072    1030000.0
3125      448000.0
Name: price, Length: 6484, dtype: float64

In [99]:
print("R2 Score:",r2_score(y_test,predict))

R2 Score: 0.7048444221074865